LuminousCX/LuomiNest/firmware/embedded/esp32-p4/sdkconfig.defaults
# LuomiNest P4 sdkconfig defaults
# 详细说明见 D:\luominest\firmware\CLAUDE.md §3
# 切片推进时按需追加: JPEG/LVGL/ETH/SPI Master 等

# 目标芯片
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SOC_MIPI_DSI_SUPPORTED=y

# PSRAM (P4 模组默认 16-Line HEX, ESP-IDF v5.5.3 Kconfig 已默认开好, 不用动)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_XIP_FROM_PSRAM=y   # 暂时关掉, 跟 L2 Cache 256KB 组合会导致 dma2d_enqueue assert

# SD 卡供电: LDO4 输出 3.3V (ESP_LDO_VO4 → SD 卡 VCC)
CONFIG_ESP_LDO_CHAN4_VOLTAGE_MV=3300

# Flash 16 MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 自定义分区表 (nvs 64K + factory 1.5M + ota_0/1 + storage)
# 详细布局见 partitions.csv, 配合 D:\luominest\firmware\CLAUDE.md §2
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# 芯片修订版本 (你的 P4 是 v1.3, ESP-IDF v5.5.3 默认 bootloader 要 v3.1+ 不兼容)
# v1.x 和 v3.x 硬件差异巨大, 必须先打开这个隐藏开关
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
# 100 = Rev v1.0 (ESP-IDF v5.5.3 不支持 v1.1/1.2/1.3 选项, v1.0 是最接近的, 小版本号升级一般二进制兼容)
CONFIG_ESP32P4_REV_MIN_FULL=100

# 编译优化
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 看门狗超时: SD 卡挂载 + frame_player 初始化需要时间
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# LVGL 9 (切片 9: app_chat 气泡)
# LVGL 9.3 Kconfig 模式 (LV_CONF_SKIP=y 是默认值):
#   - 全部配置走 sdkconfig CONFIG_LV_* 宏, 不用 lv_conf.h
#   - LVGL 内部用 lv_conf_internal.h + lv_conf_kconfig.h 替代
#   - 字体: 12/14/16 都开 (跟旧工程 main/chat_ui.c 用 14 接近, 默认 16)
#   - OS: FreeRTOS (用 _lock 手动保护 LVGL API, LVGL 内部 Kconfig 标 CONFIG_LV_USE_OS_FREERTOS 但实际跑 CONFIG_LV_OS_NONE 模式, 我们手动 _lock)
#   - 颜色深度: 16 (RGB565, 跟 JPEG 解码输出对齐)
#   - 刷新周期: 20 ms = 50 Hz (跟旧工程 CONFIG_LV_DEF_REFR_PERIOD=20 一致)
#     200 Hz 太快, 让 lv_timer_handler 反复调 flush_cb 撞 DSI draw_sem (DMA2D 模式下
#     返回 "previous draw operation is not finished"), 50Hz 安全 + 视觉流畅度足够.
# 关键宏 LV_HOR_RES_MAX / LV_VER_RES_MAX / LV_TICK_CUSTOM 在 9.3 Kconfig 里不存在,
#   - 分辨率改用 lv_display_set_physical_resolution(display, w, h) 运行时设
#   - tick 改用 lv_tick_set_cb() API 注入, 不再走 #define LV_TICK_CUSTOM
CONFIG_LV_CONF_SKIP=y
# 切片 9 重构: 不再开 CONFIG_LV_USE_OS_FREERTOS
#   esp_lvgl_port v2.8.0 自带 xSemaphoreCreateRecursiveMutex 作 lvgl_mux
#   跟 CONFIG_LV_USE_OS_FREERTOS 的 lvgl_port 自带 mutex 双 mutex 冲突
#   只能让 esp_lvgl_port 独占 LVGL 互斥
# CONFIG_LV_OS_FREERTOS=y  # 旧符号, 改用下面的 choice 形式
CONFIG_LV_DEF_REFR_PERIOD=10
# 性能监视器: 屏幕显示 FPS
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
# 切片 9 v2: 12/14/16 都开 (跟旧工程 sdkconfig 一致, 多占 ~50KB flash 可接受)
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16=y
# 双核并行软件绘制 (P4 双核, 整屏渲染瓶颈: 单核 ~30ms/帧 → 卡 33FPS).
# CNT=2 必须 OS support (否则编译报 "OS support is required when more than one SW rendering units are enabled").
# 风险: esp_lvgl_port 用 xSemaphoreCreateRecursiveMutex 保护 LVGL, LVGL OS_FREERTOS 自带 os_mutex —
#       历史上怀疑双 mutex 冲突, 但 esp_lvgl_port 2.x 已改用递归 mutex, 实测验证 (不行就回退 CNT=1).
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# PPA 硬件加速: P4 专用像素加速器, fill/image draw 交给硬件
CONFIG_LV_USE_PPA=y
CONFIG_LV_USE_PPA_IMG=y
# PPA 的 DMA 要求 draw buffer 按 L2 cache line 对齐, 否则 lv_draw_ppa_private.h 编译报错
CONFIG_LV_DRAW_BUF_ALIGN=64
# 切片 9 v2: 用 libc 而非 LVGL builtin (跟旧工程一致)
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# 切片 14: 移植旧功能 - settings_ui 需要的 LVGL 组件
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_TEXTAREA=y
CONFIG_LV_USE_BUTTON=y
CONFIG_LV_USE_SLIDER=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_SCROLLBAR=y
CONFIG_LV_USE_FLEX=y

# Ethernet (IP101G RMII, 旧工程 eth_mgr)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y
CONFIG_ETH_RMII_CLK_IN_GPIO=50

# MQTT (旧工程 app_mqtt, P4 端直连 broker 用)
CONFIG_MQTT_PROTOCOL_311=y

# SNTP (旧工程 time_mgr)
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000
